modules/user/controllers/ProfileController.php

    private function findUser(string $identifier)
    {
        $user = User::find()
            ->where(['nickname' => $identifier])
            ->orWhere(['id' => $identifier])
            ->one();
---
SELECT * FROM `user` WHERE (`nickname`='1022') OR (`id`='1022')