models/User.php

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`email`='3@got.com') AND (`status`=10)

    public function getSubscriptions(): array
    {
        /* @var $redis Connection */
        $redis = Yii::$app->redis;
        $key = "user:{$this->getId()}:subscriptions";
        $ids = $redis->smembers($key);

        return static::find()
            ->select('id, username, nickname')
            ->where(['id' => $ids])
            ->orderBy('username')
            ->asArray()
            ->all();
---
SELECT `id`, `username`, `nickname` FROM `user` WHERE `id` IN ('1023', '1024') ORDER BY `username`

    public function getFollowers(): array
    {
        /* @var $redis Connection */
        $redis = Yii::$app->redis;
        $key = "user:{$this->getId()}:followers";
        $ids = $redis->smembers($key);

        return static::find()
            ->select('id, username, nickname')
            ->where(['id' => $ids])
            ->orderBy('username')
            ->asArray()
            ->all();
---
SELECT `id`, `username`, `nickname` FROM `user` WHERE `id` IN ('1022', '1024') ORDER BY `username`

    public function mutualSubscriptions(self $user): array
    {
        $currentUserSubscriptions = "user:{$this->getId()}:subscriptions";
        $givenUserFollowers = "user:{$user->getId()}:followers";

        /* @var $redis Connection */
        $redis = Yii::$app->redis;

        $ids = $redis->sinter($currentUserSubscriptions, $givenUserFollowers);

        return static::find()
            ->select('id, username, nickname')
            ->where(['id' => $ids])
            ->orderBy('username')
            ->asArray()
            ->all();
---
SELECT `id`, `username`, `nickname` FROM `user` WHERE `id`='1023' ORDER BY `username`

    public function getFeed(int $limit): array
    {
        $order = ['post_created_at' => SORT_DESC];

        return $this
            ->hasMany(Feed::class, ['user_id' => 'id'])
            ->orderBy($order)
            ->limit($limit)
            ->all();
---
SELECT * FROM `feed` WHERE `user_id`=1024 ORDER BY `post_created_at` DESC LIMIT 200

    public function getPostCount(): int
    {
        return (int) $this
            ->hasMany(Post::class, ['user_id' => 'id'])
            ->count();
---
SELECT COUNT(*) FROM `post` WHERE `user_id`=1022

    public function getPosts(): array
    {
        $order = ['created_at' => SORT_DESC];

        return $this
            ->hasMany(Post::class, ['user_id' => 'id'])
            ->orderBy($order)
            ->all();
---
SELECT * FROM `post` WHERE `user_id`=1022 ORDER BY `created_at` DESC